{
    "0.0.1": {
        "en": "First beta release"
    },
    "0.0.2": {
        "en": "Fixed Display item MQTT (GH issue #1) and App button only showing capability (GH issue #3)"
    },
    "0.0.3": {
        "en": "Display Dim as % (GH issue #5), Fix broker reset to Homey when a new item added (GH issue #8), Sort devices alphabetically (GH issue #9), Fis missing devices from Display list (GH issue #10)"
    },
    "0.0.4": {
        "en": "Only show brokers that are enabled (GH issue #11), Fix Label and Unit lost after saving (GH issue #13)"
    },
    "0.0.5": {
        "en": "Added Panel Temperature to device. Added display buttons to the device. Removed Button Only option from the Display Configuration. Implemented Long Press (requires Button Panel firmware 0.822 or later)"
    },
    "0.0.6": {
        "en": "Added Date & Time to the panel so they can be displayed (GH issue 2). Added option to display Homey Variables (GH issue #7), Fixed: Font Size not being restored on Display Configuration settings. Fixed: Display configurations not being downloaded when changed from the panel device."
    },
    "0.0.7": {
        "en": "Added Dutch translations. Added Settings section to drop list."
    },
    "0.1.0": {
        "en": "Reworked capability names which will break existing panel settings, so you will need to reassign configurations to panels."
    },
    "0.1.1": {
        "en": "Updated Dutch translation."
    },
    "0.1.2": {
        "en": "Minor updates from review feedback."
    },
    "0.2.0": {
        "en": "Removed simulator option and optimised networking. Added brightness capabilities for the large and mini displays and the LED's. Added device settings to invert the mini displays. Added device setting for the IP address."
    },
    "0.2.1": {
        "en": "Updated driver images and readme."
    },
    "0.2.2": {
        "en": "Fix small spelling error in Flow trigger card."
    },
    "0.2.3": {
        "en": "Added Set Top Label action cards."
    },
    "0.2.4": {
        "en": "Fix crash on invalid connector number. Fix flow trigger for buttons with no device associated."
    },
    "0.2.5": {
        "en": "Fix right side button events."
    },
    "0.2.6": {
        "en": "Fix on/off text update when the associated device capability changes. Added a diagnostics log option to the app settings."
    },
    "0.2.7": {
        "en": "Added Dutch translation for diagnostics log."
    },
    "0.2.8": {
        "en": "Catche error if invalid MQTT URL specified. Added expanding sections in the settings pages"
    }
}