{
    "0.0.1": {
        "en": "First beta release"
    },
    "0.0.2": {
        "en": "Fixed Display item MQTT (GH issue #1) and App button only showing capability (GH issue #3)"
    },
    "0.0.3": {
        "en": "Display Dim as % (GH issue #5), Fix broker reset to Homey when a new item added (GH issue #8), Sort devices alphabetically (GH issue #9), Fis missing devices from Display list (GH issue #10)"
    },
    "0.0.4": {
        "en": "Only show brokers that are enabled (GH issue #11), Fix Label and Unit lost after saving (GH issue #13)"
    },
    "0.0.5": {
        "en": "Added Panel Temperature to device. Added display buttons to the device. Removed Button Only option from the Display Configuration. Implemented Long Press (requires Button Panel firmware 0.822 or later)"
    },
    "0.0.6": {
        "en": "Added Date & Time to the panel so they can be displayed (GH issue 2). Added option to display Homey Variables (GH issue #7), Fixed: Font Size not being restored on Display Configuration settings. Fixed: Display configurations not being downloaded when changed from the panel device."
    },
    "0.0.7": {
        "en": "Added Dutch translations. Added Settings section to drop list."
    },
    "0.1.0": {
        "en": "Reworked capability names which will break existing panel settings, so you will need to reassign configurations to panels."
    },
    "0.1.1": {
        "en": "Updated Dutch translation."
    },
    "0.1.2": {
        "en": "Minor updates from review feedback."
    },
    "0.2.0": {
        "en": "Removed simulator option and optimised networking. Added brightness capabilities for the large and mini displays and the LED's. Added device settings to invert the mini displays. Added device setting for the IP address."
    },
    "0.2.1": {
        "en": "Updated driver images and readme."
    },
    "0.2.2": {
        "en": "Fix small spelling error in Flow trigger card."
    },
    "0.2.3": {
        "en": "Added Set Top Label action cards."
    },
    "0.2.4": {
        "en": "Fix crash on invalid connector number. Fix flow trigger for buttons with no device associated."
    },
    "0.2.5": {
        "en": "Fix right side button events."
    },
    "0.2.6": {
        "en": "Fix on/off text update when the associated device capability changes. Added a diagnostics log option to the app settings."
    },
    "0.2.7": {
        "en": "Added Dutch translation for diagnostics log."
    },
    "0.2.8": {
        "en": "Catch error if invalid MQTT URL specified. Added expanding sections in the settings pages"
    },
    "0.2.9": {
        "en": "The device lists in the configuration sections is now sorted by and shows the zone name. Fix issues when display is on connector 0. Fix display button events not being sent. Fix for multiple panels."
    },
    "0.2.10": {
        "en": "Removed obsolete Invert option. Optimised the code to send less MQTT messages. Added auto repeat on long press for the Dim capability."        
    },
    "0.2.11": {
        "en": "Added button support for Open/Idle/Close capability. Split configuration upload into smaller chunks to avoid timeouts. Removed alignment option from the display configuration as it has been removed from the hardware. Fixed missing manual option when no devices found. Added open web view to settings page."
    },
    "0.2.12": {
        "en": "Fixes for using an external broker, including adding an option to specify a default broker. Setup a rule to make buttons non-latching if no 'On' label is specified."
    },
    "0.2.13": {
        "en": "Check for valid configuration so it doesn't have to catch errors. Added copy/paste and Import/Export configurations options #66. Added options to configure data and time format #68. Added configuration button changed flow trigger #69. Fixed status on button on connector # changed trigger #71"
    },
    "0.2.14": {
        "en": "No longer set Label to the device name #73. Fix button update when capability changes #75. Fix top label not being updated #77. Added maintenance button to re-apply configurations to the panel #76."
    },
    "0.2.15": {
        "en": "Added setting for date and time language code. Added a setting to show the Day of the week. Added Variable option to Button Configuration so a Boolean variable can be used to control the button state (Variables are read-only for an app so a flow is required to toggle the state)."
    },
    "0.2.16": {
        "en": "Fix date settings typo."
    },
    "0.3.0": {
        "en": "Added Variable option back into Display configurations. Made connector numbers consistently 1 to 4, as some places it was 0 to 3 and others 1 to 4, which might break some Flows"
    },
    "0.3.1": {
        "en": "Tidy up MQTT topics so everything is under the Homey root topic. Republish MQTT topics when a configuration is uploaded to ensure new values are up to date."
    },
    "0.3.2": {
        "en": "Fix a couple of typing error."
    },
    "0.3.3": {
        "en": "Added 'Set button label text' action Flow card. Added temperature offset setting to adjust the button + temperature value. Fix a Flow condition label typo. More Dutch translations. Fix an issue where the temperature reports could get into a loop and cause a flood of MQTT messages. Added on/off status token to configuration button changed trigger. Added a timeout and queue system to configuration transfer."
    },
    "0.3.5": {
        "en": "Fixed Right-Side Variable issue. Fixed Broker Configuration issue when enabling and disabling brokers. Display button are now non-latching. Fixed double Flow trigger for buttons that use Variables."
    },
    "0.3.6": {
        "en": "Added 'Set ... configuration # to'... Flow card. Renamed Text to Label and Label to Top label on Flow cards to be consistent with Button plus terms."
    },
    "0.3.7": {
        "en": "Fix button on / off actions cards issue when configured for App Only Button."
    },
    "0.3.8": {
        "en": "Fix Button + Temperature update on display."
    },
    "0.3.9": {
        "en": "Update to work with V1.08 firmware."
    },
    "0.3.10": {
        "en": "Update 2 to work with V1.08 firmware. Added advanced setting to device to control the status bar display."
    },
    "0.3.11": {
        "en": "Added new Condition Flow cards. Removed extra curly brackets from capability names in Configuration page. Added check for no return data from panel."
    },
    "0.3.12": {
        "en": "Updated to use homey-api instead of athom-api and a general clean up to reduce memory usage. Prevent duplicate capability listener registration."
    },
    "0.3.13": {
        "en": "Fixed missing variables from Display Configuration elements."
    },
    "0.3.14": {
        "en": "Added tips for item parameters in the Display Configuration. Add step option to Temperature Calibration in Advanced settings."
    },
    "0.3.15": {
        "en": "Added Display dim Flow action card. Force time to use a : instead of a . so the Button + doesn't treat it as a number."
    },
    "0.3.16": {
        "en": "Fix Right Button text changes to Left Button text when Top Label first changed #93. Fix mDNS discovery issue. Optimise complete configuration upload."
    },
    "0.3.17": {
        "en": "Added Flow action cards to chenage the LED colour. Add optional Configuration Name to to both Button and Display Configurations to help identify them (not in the device lists though). Reduce the size of some of the MQTT messages."
    },
    "0.4.0": {
        "en": "Added support for pages to Display Configuration (requires firmware version 1.1 or later). Optimized the MQTT messages to reduce configuration uploads when they are switched in the app. Optimized transfers to exclude unchanged configurations."
    },
    "0.4.1": {
        "en": "Fix Select Display Page Flow action card. Fix issue with button configurations not being applied correctly."
    },
    "0.4.2": {
        "en": "Return of Switch configuration by number Flow actions so they can be controlled with a variable. Fix Flow action to change a connector top label"
    },
    "0.4.3": {
        "en": "Fix Flow trigger for Button trigger"
    },
    "0.4.4": {
        "en": "Fix Capability change notification. Update Dutch translations."
    },
    "0.4.5": {
        "en": "Fix lost capabilities after hitting Save after modifying a parameter that causes a sort."
    },
    "0.4.6": {
        "en": "Fixed Flow 'Set Left/Right LED colour on connector N to colour' action card which was duplicating the configuration counterpart. Fixed issue with Button changed trigger fireing twice when another capability is assigned to the button."
    }
}