{
    "settings": {
        "Settings": "Settings",
        "autoConfig": "Allow update of Button+ configuration",
        "autoConfigWarning1": "If this option is not selected you will have to manually setup the Button+ using it's web interface.",
        "autoConfigWarning2": "<strong>Warning</strong>: With this option on, the app will overwrite the existing button+ configuration so that it can operate with this app.",
        "view": "Show Options For",
        "buttonConfigs": "Button Configurations",
        "buttonConfig": "Button Configuration",
        "displayConfigs": "Display Configurations",
        "displayConfig": "Display Configuration",
        "buttonExplanation": "Button Configrations can be applied to one or more Button+ button bars to determine what is displayed.<br>The button bar is a panel, with 2 mini displays and 2 buttons, that can be used to control On/Off and Dim type devices or run flows.<br>The Configurations can be applied to physical button bars either in the Homey app's Panel device or by using Flows",
        "displayExplanation": "Display Configrations can be applied to one or more large Button+ displays to determine what is displayed.<br>You define the X and Y position of the top left corner of the item and it's width all as a percentage of the display width.<br>You can define multiple items to display but make sure they all fit.",
        "brokerExplanation": "You can define multiple brokers to connect to.<br>Each broker can have multiple devices and each device can have multiple capabilities.<br>Brokers can be enabled or disabled and if disabled, no features will be published to it.<br>You can change which broker is the used for the 'Default' setting here. This broker is also used where no other broker definition is available",
        "panelSettings": "Button Settings",
        "LeftPanel": "Left Button",
        "RightPanel": "Right Button",
        "topLabel": "Top Label",
        "topLabelExplanation": "The Top Label is shown along the top of the mini display. It can be used to show the name of the device or flow that is controlled by the button.",
        "toplabelDisplayExplanation": "The Label is optional text to shown above the value on the display to identify it.",
        "text": "Text",
        "textExplanation": "The text to show on the display",
		"label": "Label",
        "labelOn": "Label for On state.",
        "labelOnExplanation": "The labels to show when the button is in the On state. If blank, the button will not latch, so it will switch back to the Off state when released.",
        "labelOff": "Label for Off state",
        "labelOffExplanation": "The labels to show when the button is in the Off state.",
        "device": "Device",
        "deviceExplanation": "Select the device to control when you press the Button+ button.<br>Only devices with On/Off or Dim capabilities will be shown.<br>If you select none, then nothing is directly controlled but you will still get the button pressed Flow trigger",
        "deviceDExplanation": "Select the required device or the variable option and then choose the item or variable in the Capability drop list to show on the display",
        "capability": "Capability",
        "capabilityExplanation": "Select the capability to show in the button display. If the capability is read-only or it is a variable, such as an alarm, the button will not toggle the state but the flow triggers will still work<br>",
        "capabilityDExplanation": "Select the capability or variable to show on the display. The contents of the drop list will depend on the Device you selected above.",
        "save": "Save All Configurations",
        "saved": "Configurations have been saved",
        "newDisplayItem": "New Display Item",
        "displayItemlegend": "Item __itemNo__",
        "brokerItemlegend": "Broker __itemNo__",
        "unit": "Unit",
        "unitExplanation": "The Unit is optional text to shown on the same line as the value. The text is right justified.",
        "xPos": "X Position (%)",
        "xPosExplanation": "The X Position is the horizontal position of the left side of the item as a percentage of the display width. Use 0 for the left side and 100 for the right side.",
        "yPos": "Y Position (%)",
        "yPosExplanation": "The Y Position is the vertical position of the top of the item as a percentage of the display height. Use 0 for the top and 100 for the bottom.",
        "width": "Width (%)",
        "widthExplanation": "The Width is the width of the item as a percentage of the display width.",
        "rounding": "Rounding",
        "roundingExplanation": "The number of decimal places to round the value to. Use 0 for integers.",
        "fontSize": "Font Size",
        "fontSizeExplanation": "The font size to use for the value. The range is from 1 to 4, where 1 is the smallest and 4 is the largest.",
        "deleteItem": "Delete Item",
        "deleteItemExplanation": "Delete this display item",
        "saveError1": "Error saving configurations",
        "dimValue": "Dim Change",
        "dimError": "Dim __leftRight__ Change must be between ±1 and ±100. Please correct and try again.",
        "brokerId": "Broker ID",
        "brokerIdExplanation": "Select the Broker ID that you wan to send and receive messages from.",
        "selectDevice": "Select a Homey Device",
        "selectCapability": "Select a Capability",
        "brokerConfigs": "Broker Configurations",
        "newBrokerItem": "New Broker Item",
        "address": "Address",
        "port": "Port #",
        "wsPort": "Websocket Port # (optional)",
        "enabled": "Enabled",
        "id": "Broker ID",
        "deleteBrokerItemError": "Can not delete this items",
        "brokerHomey": "This is the app's own broker. It can not be deleted but can be disabled if you don't want to use it.",
        "brokerUser": "This is a user defined broker. It can be deleted or disabled.",
        "duplicateBrokerIdError": "Broker ID '__brokerId__' already exists. Please correct and try again.",
        "MQTTTopic": "MQTT Topic",
        "MQTTTopicExplanation": "This is an optional custom MQTT topic that will be published when the button is pressed. Leave blank to toggle the Homey device button and trigger a Homey Flow.",
        "dimChangeExplanation": "The amount to change the dim level when the button is pressed.<br>This can be a positive or negative number to either brighten or darken the device.<br>Example +10 to increase the dim level bu 10% each time the button is pressed, or -10 to decrease the dim level.<br>If you omit the + or - then the dim value will be set to the specified level.",
        "type": "Event Type",
        "typeExplanation": "The Button+ Event type.",
        "topic": "Topic",
        "topicExplanation": "The MQTT topic to subscribe to.",
        "payload": "Payload",
        "payloadExplanation": "The MQTT payload to match against or send.",
        "customMQTTItemlegend": "Custom MQTT Topic __itemNo__",
        "click": "Click",
        "longPress": "Long Press",
        "led": "LED On/Off",
        "none": "None",
        "customMQTT": "Custom MQTT",
        "newCustomMQTTItem": "New MQTT Topic",
        "MQTTId": "Topic ID",
        "MQTTIdExplanation": "This is optional for your information only",
        "frontLEDOnColor": "Front LED On Color",
        "frontLEDOnColorExplanation": "The color of the front LED when the button is in the On state.",
        "wallLEDOnColor": "Wall LED On Color",
        "wallLEDOnColorExplanation": "The color of the wall LED when the button is in the On state.",
        "frontLEDOffColor": "Front LED Off Color",
        "frontLEDOffColorExplanation": "The color of the front LED when the button is in the Off state. Set to black to turn off the LED.",
        "wallLEDOffColor": "Wall LED Off Color",
        "wallLEDOffColorExplanation": "The color of the wall LED when the button is in the Off state. Set to black to turn off the LED.",
        "variable": "Variable",
        "diagnosticsLog": "Diagnostics Log",
        "enableLog": "Enable full diagnostics Log",
        "clearLog": "Clear Log",
        "sendLog": "Send Log",
        "email": "Email Address or Forum id",
        "sendLogConfirm": "Send the log contents to the developer?",
        "logSendFailed": "Error sending log: ",
        "logSent": "Log has been sent",
        "username": "Username",
        "password": "Password",
        "idExplanation": "This is a name you give to the broker to identify it. It must be unique and can't be empty.",
        "addressExplanation": "The IP address or URL (normally starting with mqtt://) of the broker.",
        "portExplanation": "The port number of the broker. Normally 1883 for MQTT or 8883 for MQTT over SSL, but it might be different if you have a custom broker.",
        "wsPortExplanation": "The port number of the broker's websocket. Normally 9001 for MQTT or 9443 for MQTT over SSL.",
        "usernameExplanation": "The username to use to connect to the broker. Leave blank if not required.",
        "passwordExplanation": "The password to use to connect to the broker. Leave blank if not required.",
        "enabledExplanation": "If enabled, the broker can be used to send and receive messages.",
        "brokerButtonPlus": "This is the Button Plus public broker that can be used for testing purposes. It can not be deleted but can be disabled if you don't want to use it.",
        "homeyUsernameExplanation": "You can define any username you like to protect the built in MQTT broker or leave it empty to disable user name protection.",
        "homeyPasswordExplanation": "You can define any password you like to protect the built in MQTT broker or leave it empty to disable password protection. If you set a password, you must also set a username.",
        "passwordError1": "You must set a username if you set a password.",
        "noEnabledBrokerError": "You must enable at least one broker.",
        "webview": "Button + device web page",
        "webviewExplanation": "Select the Homey device from the drop list and then tap on the 'Open Web view' button to open the device simulation page.<br>The device you are viewing with must be on the same network as the Button +.",
        "webviewip": "Button + device",
        "openwebview": "Open Web view",
        "defaultBroker": "Default Broker",
        "default": "Default",
        "configtoedit": "Select the configuration to edit",
        "enableLLogExplanation": "If enabled, the app will log a lot of diagnostics information.<br>The app will still log errors even if this is disabled.",
        "emailExplanation": "If you want me to respond to your log, please enter your email address or forum id here so I know how to contact you.",
        "description": "Description",
        "descriptionExplanation": "Please enter a brief description of the problem if you are going to send the log.",
        "copy": "Copy",
        "paste": "Paste",
        "copySuccess": "Copy Successful",
        "clipboardError": "Paste error: __error__",
        "importExport": "Import and Export",
        "import": "Import",
        "export": "Export",
        "importExportExplanation": "To import settings, paste the JSON text into the box below and tap the 'Import' button.<br>To export settings, tap the 'Export' button and then copy the JSON text from the box below.",
        "imported": "Settings have been imported.\n\nCheck the configurations and then tap the 'Save All Configurations' button to save them.",
        "exported:": "The settings have been copied to the panel.\n\nYou can select the all text in the panel, copy it to the clipboard and then paste them into a text file or email.",
        "copied": "The settings have been copied.\n\nYou can now paste them into another Configuration.",
        "page": "Page",
        "pageExplanation": "Select which page the item should appear on (requires firmware 1.09 or later).<br>The default is page 0, which shows on all pages on firmware 2.0.0.or later.<br>If there is more than 1 page, you can switch pages with the left or right Display buttons.",
        "configName": "Configuration Name",
        "configNameExplanation": "Enter a name for the configuration. This is optional but it will help you identify the configuration if you have more than one.",
		"longRepeat": "Long Press Repeat",
		"longRepeatExplanation": "Enable long press to repeat.",
		"boxType": "Box Type",
		"boxTypeExplanation": "Select the type of box to display the value in.",
		"boxTypeUnderlined": "Standard box with line",
		"boxTypeNotUnderlined": "Standard box without line",
		"customMQTTTopic": "Custom MQTT Topic",
		"customMQTTTopicExplanation": "This is an optional custom MQTT topic that will be published when the button is pressed.",
		"value": "Value"
    },
    "pair": {
        "manual_add":{
            "connect": "Connect",
            "intro": "Enter Connection Details",
            "title": "Add Button Panel Manually",
            "ip_address": "IP Address",
            "checking": "Checking connection",
            "try_again": "Try again",
            "correct": "Successful",
            "adding": "Adding device(s)"
        }
    },
	"repair": {
		"connect": "Repair",
		"intro": "Use this option when you add or remove buttons or when the IP address has changed.<br><br>If the IP address has changed then correct it below.<br>Tap on repair to update the connector map and save the device settings.",
		"title": "Repair device settings",
		"ip_address": "IP Address",
		"checking": "Checking connection",
		"correct": "Successful"
	},
    "connector": "Connector",
    "display": "Display",
    "left": "Left",
    "right": "Right",
    "button": "Button bar",
    "hello1": "Homey says hello",
    "hello2": "Open the Button+ Homey app settings to setup configurations",
    "hello3": "Then use the Button+ Homey device to assign configurations"
}
