{
    "settings": {
        "Settings": "Instellingen",
        "autoConfig": "Button+ configuratie updaten toestaan",
        "autoConfigWarning1": "Als deze optie niet is geselecteerd moet je de Button+ setup handmatig uitvoeren via de webinterface.",
        "autoConfigWarning2": "<strong>Waarschuwing</strong>: Met deze optie aan zal de app de bestaande Button+ configuratie overschrijven.",
        "view": "Opties weergeven voor",
        "buttonConfigs": "Button configuraties",
        "buttonConfig": "Button configuratie",
        "displayConfigs": "Display configuraties",
        "displayConfig": "Display configuratie",
        "buttonExplanation": "Button configuraties kunnen worden toegepast op één of meer Button+ Button Bars om te bepalen wat er wordt weergegeven.<br>The Button Bar is een paneel met 2 kleine displays en 2 knoppen, die kunnen worden gebruikt om aan/uit- en dimmbare apparaten te bedienen of om flows te starten.<br> De configuraties kunnen worden toegepast op Button Bars door het Homey Apps scherm apparaat of door flows",
        "displayExplanation": "Display configuraties kunnen worden toegepast op één of meer grote Button+ Displays om te bepalen wat er wordt weergegeven.<br>Je kunt de X en Y positie definiëren vanaf de hoek linksboven van het item en zijn breedte als percentage van de Display breedte.<br>Je kunt meerdere items definiëren om weer te geven, maar wees zeker dat ze allemaal passen.",
        "brokerExplanation": "Je kunt meerdere brokers definiëren mee te verbinden. Elke broker kan meerdere apparaten hebben en elk apparaat kan meerdere mogelijkheden hebben.<br>Elke broker kan in- of uitgeschakeld worden. Indien uitgeschakeld zal deze niet gebruikt worden om mee te verbinden.",
        "panelSettings": "Button instellingen",
        "LeftPanel": "Linker knop",
        "RightPanel": "Rechter knop",
        "topLabel": "Top Label",
        "topLabelExplanation": "Het Top Label wordt weergegeven aan de bovenkant van het kleine display. Het kan worden gebruikt om de naam van het apparaat of de flow weer te geven die de knop bedient.",
        "label": "Label",
        "labelExplanation": "Het label is optionele tekst die wordt weergegeven boven de waarde op het display om deze te identificeren.",    	
        "labelOn": "Label voor Aan status",
        "labelOnExplantion": "De labels om weer te geven als de knop in Aan status is.",
        "labelOff": "Label voor Uit status",
        "labelOffExplantion": "De labels om weer te geven als de knop in Uit status is.",
        "device": "Apparaat",
        "deviceExplanation": "Selecteer het apparaat om te bedienen als je op de Button+ knop drukt.<br>Alleen apparaten met Aan/Uit of Dim mogelijkheden worden weergegeven.<br>Als je niets selecteert zal niets direct worden bedient, maar je zal nog steeds de Knop Ingedrukt flow trigger krijgen",
        "deviceDExplanation": "Selecteer het benodigde device of de variabele optie en kies dan het item of de variabele in de keuzelijst om op het display weer te geven",
        "capability": "Functie",
        "capabilityExplanation": "Selecteer de functie om in de knop te laten zien. Als de functie read-only of een variabele is, zoals een alarm, dan zal de knop niet de status wijzigen maar flow triggers zullen nog steeds werken<br>",
        "capabilityDExplanation": "Selecteer de functie om weer te geven op het display. De inhoud van de keuzelijst hangt af van het device dat je hebt geselecteerd.",
        "save": "Alle configuraties opslaan",
        "saved": "Configuraties zijn opgeslagen",
        "newDisplayItem": "Nieuw Display item",
        "displayItemlegend": "Item __itemNo__",
        "brokerItemlegend": "Broker __itemNo__",
        "unit": "Unit",
        "unitExplanation": "Unit is optionele tekst om weer te geven op dezelfde lijn als de waarde. De tekst is rechts uitgelijnd.",
        "xPos": "X Positie (%)",
        "xPosExplanation": "De X positie is de horizontale positie van de linkerzijde van het item als percentage van de displaybreedte. Kies 0 voor de linkerzijde en 100 voor de rechterzijde.",
        "yPos": "Y Positie (%)",
        "yPosExplanation": "De Y positie is de verticale positie van de bovenzijde van het item als percentage van de displayhoogte. Kies 0 voor de bovenkant en 100 voor de onderkant.",
        "width": "Breedte (%)",
        "widthExplanation": "De breedte is de breedte van het item als precentage van de display breedte.",
        "rounding": "Afronding",
        "roundingExplanation": "Het aantal decimalen om de waarde op af te ronden. Gebruik 0 voor gehele getallen.",
        "fontSize": "Letter grootte",
        "fontSizeExplanation": "De letter grootte om te gebruiken voor de waarde. het bereik is 1 t/m 4, waar 1 de kleinste en 4 de grootste tekstgrootte is.",
        "deleteItem": "Item verwijderen",
        "deleteItemExplanation": "Verwijder dit display item",
        "saveError1": "Fout bij opslaan",
        "dimValue": "Dim waarde",
        "dimError": "Dim __leftRight__ Waarde moet tussen ±1 en ±100 liggen. Wijzig en probeer opnieuw.",
        "brokerId": "Broker ID",
        "brokerIdExplanation": "Selecteer de Broker ID waar je berichten mee wilt uitwisselen.",
        "selectDevice": "Selecteer een Homey apparaat",
        "selectCapability": "Selecteer een functie",
        "brokerConfigs": "Broker configuraties",
        "newBrokerItem": "Nieuw broker item",
        "address": "Adres (IP of URL) van de broker",
        "port": "Poort #",
        "wsPort": "Websocket poort # (optioneel)",
        "enabled": "Ingeschakeld",
        "id": "Broker ID (om de broker te identificeren, moet uniek zijn)",
        "deleteBrokerItemError": "Kan deze items niet verwijderen",
        "brokerHomey": "Dit is de apps' eigen broker. Deze kan niet worden verwijderd, maar kan worden uitgeschakeld als je deze niet wilt gebruiken.",
        "brokerUser": "Dit is een gebruiker-gedefiniëerde broker. Deze kan worden verwijderd of uitgeschakeld.",
        "duplicateBrokerIdError": "Broker ID '__brokerId__' bestaat al. Wijzig en probeer opnieuw.",
        "MQTTTopic": "MQTT Topic",
        "MQTTTopicExplanation": "Dit is een optioneel eigengemaakt MQTT topic die zal worden gepubliceert als de knop wordt ingedrukt. Laat blanco om de Homey apparaat knop te bedienen en een Homey flow te triggeren.",
        "dimChangeExplanation": "De waarde om het dimniveau mee te wijzigen als de knop wordt ingedrukt<br>Dit kan een positieve waarde zijn om het dimniveau van het apparaat te verhogen of een negatieve om te verlagen.<br>Bijvoorbeeld +10 om het dimniveau te verhogen of -10 om het dimniveau te verlagen voor elke keer dat de knop wordt ingedrukt. Als je + of - weglaat zal het dimniveau op de gespecificeerde waarde worden ingesteld.",
        "type": "Event Type",
        "typeExplanation": "Het Button+ event type.",
        "topic": "Topic",
        "topicExplanation": "Het MQTT topic om op te abonneren.",
        "payload": "Payload",
        "payloadExplanation": "De MQTT payload om te matchen of te sturen.",
        "customMQTTItemlegend": "Aangepast MQTT Topic __itemNo__",
        "click": "Klik",
        "longPress": "Ingedrukt houden",
        "led": "LED Aan/Uit",
        "none": "Alleen App knop",
        "customMQTT": "Aangepaste MQTT",
        "newCustomMQTTItem": "Nieuw MQTT Topic",
        "MQTTId": "Topic ID",
        "MQTTIdExplanation": "Dit is optioneel, alleen ter info",
        "frontLEDColor": "LED kleur voorzijde",
        "frontLEDColorExplanation": "De kleur van de voorste LED als de knop in Aan status is.",
        "wallLEDColor": "LED achterzijde",
        "wallLEDColorExplanation": "De kleur van de achterste LED als de knop in Aan status is.",
        "variable": "Variabele",
        "diagnosticsLog": "Diagnostiek log",
        "enableLog": "Volledig diagnostisch log activeren",
        "clearLog": "Log wissen",
        "sendLog": "Log versturen",
        "email": "E-mail adres of Homey Community id (Vereist als je wil dat ik antwoord)",
        "sendLogConfirm": "stuur de inhoud van de log naar de developer?",
        "logSendFailed": "Fout bij versturen log: ",
        "logSent": "Log is verstuurd",
        "username": "Gebruikersnaam",
        "password": "Wachtwoord",
        "idExplanation": "Dit is de naam van de broker om hem te identificeren. Deze moet uniek zijn en mag niet leeg blijven.",
        "addressExplanation": "Het IP-adres of de URL (start meestal met mqtt://) van de broker.",
        "portExplanation": "Het poortnummer van de broker. Meestal 1883 voor MQTT of 8883 voor MQTT over SSL, maar kan anders zijn als je een eigen broker hebt",
        "wsPortExplanation": "Het poortnummer van de broker's websocket. Meestal 9001 voor MQTT of 9443 voor MQTT over SSL.",
        "usernameExplanation": "De gebruikersnaam om met de broker verbinding te maken. Laat leeg als deze niet nodig is.",
        "passwordExplanation": "Het wachtwoord om met de broker verbinding te maken. Laat leeg als deze niet nodig is.",
        "enabledExplanation": "Indien geactiveerd kan de broker gebruikt worden om berichten te versturen en ontvangen.",
        "brokerButtonPlus": "Dit is de Button+ publieke broker die kan worden gebruikt voor test doeleinden. Deze kan niet worden verwijderd maar wel gedeactiveerd als je deze niet wil gebruiken.",
        "homeyUsernameExplanation": "Je kunt elke gebruikersnaam opgeven die je wil om de ingebouwde MQTT broker te beveiligen of laat deze leeg als je deze beveiliging niet wil gebruiken.",
        "homeyPasswordExplanation": "Je kunt elk wachtwoord opgeven die je wil om de ingebouwde MQTT broker te beveiligen of laat deze leeg als je deze beveiliging niet wil gebruiken. Als je een wachtwoord instelt, moet je ook een gebruikersnaam opgeven.",
        "passwordError1": "Je moet een gebruikersnaam opgeven als je een wachtwoord opgeeft.",
        "noEnabledBrokerError": "Je moet tenminste één broker activeren",
        "webview": "Button+ device webpagina",
        "webviewExplanation": "Selecteer het Homey device in de lijst en tik op 'Open Web weergave' om de device simulatie pagina te openen.<br>Het apparaat waarmee je deze bekijkt moet in hetzelfde netwerk zitten als de Button+.",
        "webviewip": "Button+ device",
        "openwebview": "Open Web weergave",
        "defaultBroker": "Standaard Broker",
        "default": "Standaard",
        "configtoedit": "Selecteer de te bewerken configuratie",
        "enableLLogExplanation": "Indien geactiveerd, zal de app veel diagnostische informatie loggen.<br>De app zal nog steeds fouten loggen, ook als deze instelling is uitgeschakeld.",
        "emailExplanation": "Als je wil dat ik reageer op je log, vul dan hier je emailadres of forum-id in, zodat ik weet hoe ik je kan bereiken.",
        "description": "Omschrijving",
        "descriptionExplanation": "Geef een korte omschrijving van het probleem als je de log verstuurd.",
        "copy": "Kopiëren",
        "paste": "Plakken",
        "copySuccess": "Kopiëren gelukt",
        "clipboardError": "Fout bij plakken: __error__",
        "importExport": "Importeren and Exporteren",
        "import": "Importeren",
        "export": "Exporteren",
        "importExportExplanation": "Om instellingen te importeren, plak de JSON text hieronder en druk op 'Import'.<br>Om instellingen te exporteren, druk op 'Export' en kopiëer de JSON text vanaf hier beneden.",
        "imported": "Instellingen zijn geimporteerd.\n\nControleer de configuraties en druk dan op 'Alle configuraties opslaan' om deze op te slaan.",
        "exported:": "Instellingen zijn gekopieerd naar het panel.\n\nJe kunt alle tekst in het panel selecteren, naar het klembord kopieren en daarna plakken in een tekstbestand of email.",
        "copied": "Instellingen zijn gekopieerd.\n\nje kunt deze nu plakken in een andere Configuratie.",
        "screenNo": "Scherm index",
        "screenNoExplanation": "Slecteer het scherm index om het item op weer te geven. De standaard is scherm 1. Als er meer dan 1 scherm is, kun je schermen wisselen met de linker- en rechterknoppen op het display.",
        "configName": "Configuratie naam",
        "configNameExplanation": "Geef een naam op voor de configuratie. Dit is optioneel maar het helpt je om de configuratie te indentificeren als je er meer dan een hebt."
    },
    "pair": {
        "manual_add":{
            "connect": "Verbinden",
            "intro": "Voer verbindings details in",
            "title": "Button Panel handmatig toevoegen",
            "ip_address": "IP adres",
            "checking": "Verbinding controleren",
            "try_again": "Probeer opnieuw",
            "correct": "Succesvol",
            "adding": "Appararaat/apparaten toevoegen"
        }
    },
    "connector": "Connector",
    "display": "Display",
    "left": "Links",
    "right": "Rechts",
    "button": "Button Bar",
    "hello1": "Homey zegt hallo",
    "hello2": "Open de Button+ Homey app instellingen om configuraties samen te stellen",
    "hello3": "Gebruik daarna het Button+ Homey device om configuraties toe te kennen"
} 
